MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF064/mcu.h
extern volatile __OC6CONbits_t OC6CONbits __asm__ ("OC6CON") __attribute__((section("sfrs"), address(0xBF844A00)));
extern volatile uint32_t        OC6CONCLR __attribute__((section("sfrs"),address(0xBF844A04)));
extern volatile uint32_t        OC6CONSET __attribute__((section("sfrs"),address(0xBF844A08)));
extern volatile uint32_t        OC6CONINV __attribute__((section("sfrs"),address(0xBF844A0C)));
#define OC6R OC6R
extern volatile uint32_t   OC6R __attribute__((section("sfrs"), address(0xBF844A10)));
extern volatile uint32_t        OC6RCLR __attribute__((section("sfrs"),address(0xBF844A14)));
extern volatile uint32_t        OC6RSET __attribute__((section("sfrs"),address(0xBF844A18)));
extern volatile uint32_t        OC6RINV __attribute__((section("sfrs"),address(0xBF844A1C)));
#define OC6RS OC6RS
extern volatile uint32_t   OC6RS __attribute__((section("sfrs"), address(0xBF844A20)));
extern volatile uint32_t        OC6RSCLR __attribute__((section("sfrs"),address(0xBF844A24)));
extern volatile uint32_t        OC6RSSET __attribute__((section("sfrs"),address(0xBF844A28)));
extern volatile uint32_t        OC6RSINV __attribute__((section("sfrs"),address(0xBF844A2C)));
#define OC7CON OC7CON
extern volatile uint32_t   OC7CON __attribute__((section("sfrs"), address(0xBF844C00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC7CONbits_t;
extern volatile __OC7CONbits_t OC7CONbits __asm__ ("OC7CON") __attribute__((section("sfrs"), address(0xBF844C00)));
extern volatile uint32_t        OC7CONCLR __attribute__((section("sfrs"),address(0xBF844C04)));
extern volatile uint32_t        OC7CONSET __attribute__((section("sfrs"),address(0xBF844C08)));
extern volatile uint32_t        OC7CONINV __attribute__((section("sfrs"),address(0xBF844C0C)));
#define OC7R OC7R
extern volatile uint32_t   OC7R __attribute__((section("sfrs"), address(0xBF844C10)));
extern volatile uint32_t        OC7RCLR __attribute__((section("sfrs"),address(0xBF844C14)));
extern volatile uint32_t        OC7RSET __attribute__((section("sfrs"),address(0xBF844C18)));
extern volatile uint32_t        OC7RINV __attribute__((section("sfrs"),address(0xBF844C1C)));
#define OC7RS OC7RS
extern volatile uint32_t   OC7RS __attribute__((section("sfrs"), address(0xBF844C20)));
extern volatile uint32_t        OC7RSCLR __attribute__((section("sfrs"),address(0xBF844C24)));
extern volatile uint32_t        OC7RSSET __attribute__((section("sfrs"),address(0xBF844C28)));
extern volatile uint32_t        OC7RSINV __attribute__((section("sfrs"),address(0xBF844C2C)));
#define OC8CON OC8CON
extern volatile uint32_t   OC8CON __attribute__((section("sfrs"), address(0xBF844E00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC8CONbits_t;
extern volatile __OC8CONbits_t OC8CONbits __asm__ ("OC8CON") __attribute__((section("sfrs"), address(0xBF844E00)));
extern volatile uint32_t        OC8CONCLR __attribute__((section("sfrs"),address(0xBF844E04)));
extern volatile uint32_t        OC8CONSET __attribute__((section("sfrs"),address(0xBF844E08)));
extern volatile uint32_t        OC8CONINV __attribute__((section("sfrs"),address(0xBF844E0C)));
#define OC8R OC8R
extern volatile uint32_t   OC8R __attribute__((section("sfrs"), address(0xBF844E10)));
extern volatile uint32_t        OC8RCLR __attribute__((section("sfrs"),address(0xBF844E14)));
extern volatile uint32_t        OC8RSET __attribute__((section("sfrs"),address(0xBF844E18)));
extern volatile uint32_t        OC8RINV __attribute__((section("sfrs"),address(0xBF844E1C)));
#define OC8RS OC8RS
extern volatile uint32_t   OC8RS __attribute__((section("sfrs"), address(0xBF844E20)));
extern volatile uint32_t        OC8RSCLR __attribute__((section("sfrs"),address(0xBF844E24)));
extern volatile uint32_t        OC8RSSET __attribute__((section("sfrs"),address(0xBF844E28)));
extern volatile uint32_t        OC8RSINV __attribute__((section("sfrs"),address(0xBF844E2C)));
#define OC9CON OC9CON
extern volatile uint32_t   OC9CON __attribute__((section("sfrs"), address(0xBF845000)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC9CONbits_t;
extern volatile __OC9CONbits_t OC9CONbits __asm__ ("OC9CON") __attribute__((section("sfrs"), address(0xBF845000)));
extern volatile uint32_t        OC9CONCLR __attribute__((section("sfrs"),address(0xBF845004)));
extern volatile uint32_t        OC9CONSET __attribute__((section("sfrs"),address(0xBF845008)));
extern volatile uint32_t        OC9CONINV __attribute__((section("sfrs"),address(0xBF84500C)));
#define OC9R OC9R
extern volatile uint32_t   OC9R __attribute__((section("sfrs"), address(0xBF845010)));
extern volatile uint32_t        OC9RCLR __attribute__((section("sfrs"),address(0xBF845014)));
extern volatile uint32_t        OC9RSET __attribute__((section("sfrs"),address(0xBF845018)));
extern volatile uint32_t        OC9RINV __attribute__((section("sfrs"),address(0xBF84501C)));
#define OC9RS OC9RS
extern volatile uint32_t   OC9RS __attribute__((section("sfrs"), address(0xBF845020)));
extern volatile uint32_t        OC9RSCLR __attribute__((section("sfrs"),address(0xBF845024)));
extern volatile uint32_t        OC9RSSET __attribute__((section("sfrs"),address(0xBF845028)));
extern volatile uint32_t        OC9RSINV __attribute__((section("sfrs"),address(0xBF84502C)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF84B000)));
typedef struct {
  uint32_t :3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t CVDEN:1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF84B000)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF84B004)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF84B004)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF84B008)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t DIGEN2:1;
  uint32_t DIGEN3:1;
  uint32_t DIGEN4:1;
  uint32_t :2;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF84B008)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF84B00C)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t SSAMPEN2:1;
  uint32_t SSAMPEN3:1;
  uint32_t SSAMPEN4:1;
  uint32_t :3;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t STRGEN2:1;
  uint32_t STRGEN3:1;
  uint32_t STRGEN4:1;
  uint32_t :3;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF84B00C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF84B010)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
extern volatile __ADCIMCON1bits_t ADCIMCON1bits __asm__ ("ADCIMCON1") __attribute__((section("sfrs"), address(0xBF84B010)));
#define ADCIMCON2 ADCIMCON2
extern volatile uint32_t   ADCIMCON2 __attribute__((section("sfrs"), address(0xBF84B014)));
typedef struct {
  uint32_t SIGN16:1;
  uint32_t DIFF16:1;
  uint32_t SIGN17:1;
  uint32_t DIFF17:1;
  uint32_t SIGN18:1;
  uint32_t DIFF18:1;
} __ADCIMCON2bits_t;
extern volatile __ADCIMCON2bits_t ADCIMCON2bits __asm__ ("ADCIMCON2") __attribute__((section("sfrs"), address(0xBF84B014)));
#define ADCIMCON3 ADCIMCON3
extern volatile uint32_t   ADCIMCON3 __attribute__((section("sfrs"), address(0xBF84B018)));
typedef struct {
  uint32_t :22;
  uint32_t SIGN43:1;
  uint32_t DIFF43:1;
  uint32_t SIGN44:1;
  uint32_t DIFF44:1;
} __ADCIMCON3bits_t;
extern volatile __ADCIMCON3bits_t ADCIMCON3bits __asm__ ("ADCIMCON3") __attribute__((section("sfrs"), address(0xBF84B018)));
#define ADCGIRQEN1 ADCGIRQEN1
extern volatile uint32_t   ADCGIRQEN1 __attribute__((section("sfrs"), address(0xBF84B020)));
typedef struct {
  uint32_t AGIEN0:1;
  uint32_t AGIEN1:1;
  uint32_t AGIEN2:1;
  uint32_t AGIEN3:1;
  uint32_t AGIEN4:1;
  uint32_t AGIEN5:1;
  uint32_t AGIEN6:1;
  uint32_t AGIEN7:1;
  uint32_t AGIEN8:1;
  uint32_t AGIEN9:1;
  uint32_t AGIEN10:1;
  uint32_t AGIEN11:1;
  uint32_t AGIEN12:1;
  uint32_t AGIEN13:1;
  uint32_t AGIEN14:1;
  uint32_t AGIEN15:1;
  uint32_t AGIEN16:1;
  uint32_t AGIEN17:1;
  uint32_t AGIEN18:1;
} __ADCGIRQEN1bits_t;
extern volatile __ADCGIRQEN1bits_t ADCGIRQEN1bits __asm__ ("ADCGIRQEN1") __attribute__((section("sfrs"), address(0xBF84B020)));
#define ADCGIRQEN2 ADCGIRQEN2
extern volatile uint32_t   ADCGIRQEN2 __attribute__((section("sfrs"), address(0xBF84B024)));
typedef struct {
  uint32_t :11;
  uint32_t AGIEN43:1;
  uint32_t AGIEN44:1;
} __ADCGIRQEN2bits_t;
extern volatile __ADCGIRQEN2bits_t ADCGIRQEN2bits __asm__ ("ADCGIRQEN2") __attribute__((section("sfrs"), address(0xBF84B024)));
#define ADCCSS1 ADCCSS1
extern volatile uint32_t   ADCCSS1 __attribute__((section("sfrs"), address(0xBF84B028)));
typedef struct {
  uint32_t CSS0:1;
  uint32_t CSS1:1;
  uint32_t CSS2:1;
  uint32_t CSS3:1;
  uint32_t CSS4:1;
  uint32_t CSS5:1;
  uint32_t CSS6:1;
  uint32_t CSS7:1;
  uint32_t CSS8:1;
  uint32_t CSS9:1;
  uint32_t CSS10:1;
  uint32_t CSS11:1;
  uint32_t CSS12:1;
  uint32_t CSS13:1;
  uint32_t CSS14:1;
  uint32_t CSS15:1;
  uint32_t CSS16:1;
  uint32_t CSS17:1;
  uint32_t CSS18:1;
} __ADCCSS1bits_t;
extern volatile __ADCCSS1bits_t ADCCSS1bits __asm__ ("ADCCSS1") __attribute__((section("sfrs"), address(0xBF84B028)));
#define ADCCSS2 ADCCSS2
extern volatile uint32_t   ADCCSS2 __attribute__((section("sfrs"), address(0xBF84B02C)));
typedef struct {
  uint32_t :11;
  uint32_t CSS43:1;
  uint32_t CSS44:1;
} __ADCCSS2bits_t;
extern volatile __ADCCSS2bits_t ADCCSS2bits __asm__ ("ADCCSS2") __attribute__((section("sfrs"), address(0xBF84B02C)));
#define ADCDSTAT1 ADCDSTAT1
extern volatile uint32_t   ADCDSTAT1 __attribute__((section("sfrs"), address(0xBF84B030)));
typedef struct {
  uint32_t ARDY0:1;
  uint32_t ARDY1:1;
  uint32_t ARDY2:1;
  uint32_t ARDY3:1;
  uint32_t ARDY4:1;
  uint32_t ARDY5:1;
  uint32_t ARDY6:1;
  uint32_t ARDY7:1;
  uint32_t ARDY8:1;
  uint32_t ARDY9:1;
  uint32_t ARDY10:1;
  uint32_t ARDY11:1;
  uint32_t ARDY12:1;
  uint32_t ARDY13:1;
  uint32_t ARDY14:1;
  uint32_t ARDY15:1;
  uint32_t ARDY16:1;
  uint32_t ARDY17:1;
  uint32_t ARDY18:1;
} __ADCDSTAT1bits_t;
extern volatile __ADCDSTAT1bits_t ADCDSTAT1bits __asm__ ("ADCDSTAT1") __attribute__((section("sfrs"), address(0xBF84B030)));
#define ADCDSTAT2 ADCDSTAT2
extern volatile uint32_t   ADCDSTAT2 __attribute__((section("sfrs"), address(0xBF84B034)));
typedef struct {
  uint32_t :11;
  uint32_t ARDY43:1;
  uint32_t ARDY44:1;
} __ADCDSTAT2bits_t;
