MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF064/mcu.h
extern volatile __ADCFLTR5bits_t ADCFLTR5bits __asm__ ("ADCFLTR5") __attribute__((section("sfrs"), address(0xBF84B078)));
#define ADCFLTR6 ADCFLTR6
extern volatile uint32_t   ADCFLTR6 __attribute__((section("sfrs"), address(0xBF84B07C)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR6bits_t;
extern volatile __ADCFLTR6bits_t ADCFLTR6bits __asm__ ("ADCFLTR6") __attribute__((section("sfrs"), address(0xBF84B07C)));
#define ADCTRG1 ADCTRG1
extern volatile uint32_t   ADCTRG1 __attribute__((section("sfrs"), address(0xBF84B080)));
typedef struct {
  uint32_t TRGSRC0:5;
  uint32_t :3;
  uint32_t TRGSRC1:5;
  uint32_t :3;
  uint32_t TRGSRC2:5;
  uint32_t :3;
  uint32_t TRGSRC3:5;
} __ADCTRG1bits_t;
extern volatile __ADCTRG1bits_t ADCTRG1bits __asm__ ("ADCTRG1") __attribute__((section("sfrs"), address(0xBF84B080)));
#define ADCTRG2 ADCTRG2
extern volatile uint32_t   ADCTRG2 __attribute__((section("sfrs"), address(0xBF84B084)));
typedef struct {
  uint32_t TRGSRC4:5;
  uint32_t :3;
  uint32_t TRGSRC5:5;
  uint32_t :3;
  uint32_t TRGSRC6:5;
  uint32_t :3;
  uint32_t TRGSRC7:5;
} __ADCTRG2bits_t;
extern volatile __ADCTRG2bits_t ADCTRG2bits __asm__ ("ADCTRG2") __attribute__((section("sfrs"), address(0xBF84B084)));
#define ADCTRG3 ADCTRG3
extern volatile uint32_t   ADCTRG3 __attribute__((section("sfrs"), address(0xBF84B088)));
typedef struct {
  uint32_t TRGSRC8:5;
  uint32_t :3;
  uint32_t TRGSRC9:5;
  uint32_t :3;
  uint32_t TRGSRC10:5;
  uint32_t :3;
  uint32_t TRGSRC11:5;
} __ADCTRG3bits_t;
extern volatile __ADCTRG3bits_t ADCTRG3bits __asm__ ("ADCTRG3") __attribute__((section("sfrs"), address(0xBF84B088)));
#define ADCCMPCON1 ADCCMPCON1
extern volatile uint32_t   ADCCMPCON1 __attribute__((section("sfrs"), address(0xBF84B0A0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:6;
  uint32_t :2;
  uint32_t CVDDATA:16;
} __ADCCMPCON1bits_t;
extern volatile __ADCCMPCON1bits_t ADCCMPCON1bits __asm__ ("ADCCMPCON1") __attribute__((section("sfrs"), address(0xBF84B0A0)));
#define ADCCMPCON2 ADCCMPCON2
extern volatile uint32_t   ADCCMPCON2 __attribute__((section("sfrs"), address(0xBF84B0A4)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON2bits_t;
extern volatile __ADCCMPCON2bits_t ADCCMPCON2bits __asm__ ("ADCCMPCON2") __attribute__((section("sfrs"), address(0xBF84B0A4)));
#define ADCCMPCON3 ADCCMPCON3
extern volatile uint32_t   ADCCMPCON3 __attribute__((section("sfrs"), address(0xBF84B0A8)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON3bits_t;
extern volatile __ADCCMPCON3bits_t ADCCMPCON3bits __asm__ ("ADCCMPCON3") __attribute__((section("sfrs"), address(0xBF84B0A8)));
#define ADCCMPCON4 ADCCMPCON4
extern volatile uint32_t   ADCCMPCON4 __attribute__((section("sfrs"), address(0xBF84B0AC)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON4bits_t;
extern volatile __ADCCMPCON4bits_t ADCCMPCON4bits __asm__ ("ADCCMPCON4") __attribute__((section("sfrs"), address(0xBF84B0AC)));
#define ADCCMPCON5 ADCCMPCON5
extern volatile uint32_t   ADCCMPCON5 __attribute__((section("sfrs"), address(0xBF84B0B0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON5bits_t;
extern volatile __ADCCMPCON5bits_t ADCCMPCON5bits __asm__ ("ADCCMPCON5") __attribute__((section("sfrs"), address(0xBF84B0B0)));
#define ADCCMPCON6 ADCCMPCON6
extern volatile uint32_t   ADCCMPCON6 __attribute__((section("sfrs"), address(0xBF84B0B4)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON6bits_t;
extern volatile __ADCCMPCON6bits_t ADCCMPCON6bits __asm__ ("ADCCMPCON6") __attribute__((section("sfrs"), address(0xBF84B0B4)));
#define ADCFSTAT ADCFSTAT
extern volatile uint32_t   ADCFSTAT __attribute__((section("sfrs"), address(0xBF84B0B8)));
typedef struct {
  uint32_t ADCID:3;
  uint32_t :4;
  uint32_t FSIGN:1;
  uint32_t FCNT:8;
  uint32_t :5;
  uint32_t FWROVERR:1;
  uint32_t FRDY:1;
  uint32_t FIEN:1;
  uint32_t ADC0EN:1;
  uint32_t ADC1EN:1;
  uint32_t ADC2EN:1;
  uint32_t ADC3EN:1;
  uint32_t ADC4EN:1;
  uint32_t :2;
  uint32_t FEN:1;
} __ADCFSTATbits_t;
extern volatile __ADCFSTATbits_t ADCFSTATbits __asm__ ("ADCFSTAT") __attribute__((section("sfrs"), address(0xBF84B0B8)));
#define ADCFIFO ADCFIFO
extern volatile uint32_t   ADCFIFO __attribute__((section("sfrs"), address(0xBF84B0BC)));
typedef struct {
  uint32_t DATA:32;
} __ADCFIFObits_t;
extern volatile __ADCFIFObits_t ADCFIFObits __asm__ ("ADCFIFO") __attribute__((section("sfrs"), address(0xBF84B0BC)));
#define ADCBASE ADCBASE
extern volatile uint32_t   ADCBASE __attribute__((section("sfrs"), address(0xBF84B0C0)));
typedef struct {
  uint32_t ADCBASE:16;
} __ADCBASEbits_t;
extern volatile __ADCBASEbits_t ADCBASEbits __asm__ ("ADCBASE") __attribute__((section("sfrs"), address(0xBF84B0C0)));
#define ADCTRGSNS ADCTRGSNS
extern volatile uint32_t   ADCTRGSNS __attribute__((section("sfrs"), address(0xBF84B0D0)));
typedef struct {
  uint32_t LVL0:1;
  uint32_t LVL1:1;
  uint32_t LVL2:1;
  uint32_t LVL3:1;
  uint32_t LVL4:1;
  uint32_t LVL5:1;
  uint32_t LVL6:1;
  uint32_t LVL7:1;
  uint32_t LVL8:1;
  uint32_t LVL9:1;
  uint32_t LVL10:1;
  uint32_t LVL11:1;
} __ADCTRGSNSbits_t;
extern volatile __ADCTRGSNSbits_t ADCTRGSNSbits __asm__ ("ADCTRGSNS") __attribute__((section("sfrs"), address(0xBF84B0D0)));
#define ADC0TIME ADC0TIME
extern volatile uint32_t   ADC0TIME __attribute__((section("sfrs"), address(0xBF84B0D4)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC0TIMEbits_t;
extern volatile __ADC0TIMEbits_t ADC0TIMEbits __asm__ ("ADC0TIME") __attribute__((section("sfrs"), address(0xBF84B0D4)));
#define ADC1TIME ADC1TIME
extern volatile uint32_t   ADC1TIME __attribute__((section("sfrs"), address(0xBF84B0D8)));
typedef struct {
  uint32_t SAMC:10;
  uint32_t :6;
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t SELRES:2;
  uint32_t ADCEIS:3;
} __ADC1TIMEbits_t;
