MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF064/mcu.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef union {
  struct {
    uint32_t CNSTATD0:1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t :3;
    uint32_t CNSTATD9:1;
    uint32_t CNSTATD10:1;
    uint32_t CNSTATD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define CNNED CNNED
extern volatile uint32_t   CNNED __attribute__((section("sfrs"), address(0xBF8603A0)));
typedef struct {
  uint32_t CNNED0:1;
  uint32_t CNNED1:1;
  uint32_t CNNED2:1;
  uint32_t CNNED3:1;
  uint32_t CNNED4:1;
  uint32_t CNNED5:1;
  uint32_t :3;
  uint32_t CNNED9:1;
  uint32_t CNNED10:1;
  uint32_t CNNED11:1;
} __CNNEDbits_t;
extern volatile __CNNEDbits_t CNNEDbits __asm__ ("CNNED") __attribute__((section("sfrs"), address(0xBF8603A0)));
extern volatile uint32_t        CNNEDCLR __attribute__((section("sfrs"),address(0xBF8603A4)));
extern volatile uint32_t        CNNEDSET __attribute__((section("sfrs"),address(0xBF8603A8)));
extern volatile uint32_t        CNNEDINV __attribute__((section("sfrs"),address(0xBF8603AC)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF8603B0)));
typedef struct {
  uint32_t CNFD0:1;
  uint32_t CNFD1:1;
  uint32_t CNFD2:1;
  uint32_t CNFD3:1;
  uint32_t CNFD4:1;
  uint32_t CNFD5:1;
  uint32_t :3;
  uint32_t CNFD9:1;
  uint32_t CNFD10:1;
  uint32_t CNFD11:1;
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits __asm__ ("CNFD") __attribute__((section("sfrs"), address(0xBF8603B0)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF8603B4)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF8603B8)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF8603BC)));
#define ANSELE ANSELE
extern volatile uint32_t   ANSELE __attribute__((section("sfrs"), address(0xBF860400)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t ANSE4:1;
    uint32_t ANSE5:1;
    uint32_t ANSE6:1;
    uint32_t ANSE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs"), address(0xBF860400)));
extern volatile uint32_t        ANSELECLR __attribute__((section("sfrs"),address(0xBF860404)));
extern volatile uint32_t        ANSELESET __attribute__((section("sfrs"),address(0xBF860408)));
extern volatile uint32_t        ANSELEINV __attribute__((section("sfrs"),address(0xBF86040C)));
#define TRISE TRISE
extern volatile uint32_t   TRISE __attribute__((section("sfrs"), address(0xBF860410)));
typedef union {
  struct {
    uint32_t TRISE0:1;
    uint32_t TRISE1:1;
    uint32_t TRISE2:1;
    uint32_t TRISE3:1;
    uint32_t TRISE4:1;
    uint32_t TRISE5:1;
    uint32_t TRISE6:1;
    uint32_t TRISE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISEbits_t;
extern volatile __TRISEbits_t TRISEbits __asm__ ("TRISE") __attribute__((section("sfrs"), address(0xBF860410)));
extern volatile uint32_t        TRISECLR __attribute__((section("sfrs"),address(0xBF860414)));
extern volatile uint32_t        TRISESET __attribute__((section("sfrs"),address(0xBF860418)));
extern volatile uint32_t        TRISEINV __attribute__((section("sfrs"),address(0xBF86041C)));
#define PORTE PORTE
extern volatile uint32_t   PORTE __attribute__((section("sfrs"), address(0xBF860420)));
typedef union {
  struct {
    uint32_t RE0:1;
    uint32_t RE1:1;
    uint32_t RE2:1;
    uint32_t RE3:1;
    uint32_t RE4:1;
    uint32_t RE5:1;
    uint32_t RE6:1;
    uint32_t RE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTEbits_t;
extern volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs"), address(0xBF860420)));
extern volatile uint32_t        PORTECLR __attribute__((section("sfrs"),address(0xBF860424)));
extern volatile uint32_t        PORTESET __attribute__((section("sfrs"),address(0xBF860428)));
extern volatile uint32_t        PORTEINV __attribute__((section("sfrs"),address(0xBF86042C)));
#define LATE LATE
extern volatile uint32_t   LATE __attribute__((section("sfrs"), address(0xBF860430)));
typedef union {
  struct {
    uint32_t LATE0:1;
    uint32_t LATE1:1;
    uint32_t LATE2:1;
    uint32_t LATE3:1;
    uint32_t LATE4:1;
    uint32_t LATE5:1;
    uint32_t LATE6:1;
    uint32_t LATE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF860430)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF860434)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF860438)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF86043C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF860440)));
typedef union {
  struct {
    uint32_t ODCE0:1;
    uint32_t ODCE1:1;
    uint32_t ODCE2:1;
    uint32_t ODCE3:1;
    uint32_t ODCE4:1;
    uint32_t ODCE5:1;
    uint32_t ODCE6:1;
    uint32_t ODCE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF860440)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF860444)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF860448)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF86044C)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF860450)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t CNPUE2:1;
    uint32_t CNPUE3:1;
    uint32_t CNPUE4:1;
    uint32_t CNPUE5:1;
    uint32_t CNPUE6:1;
    uint32_t CNPUE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
